ROR/valdemo1/app/controllers/valtests_controller.rb

  def index
    @valtest = Valtest.all
---
SELECT "valtests".* FROM "valtests"

   def show
    @valtest = Valtest.find(params[:id])
---
SELECT  "valtests".* FROM "valtests" WHERE "valtests"."id" = ? LIMIT 1  [["id", 1]]

  def edit
    @valtest = Valtest.find(params[:id])
---
SELECT  "valtests".* FROM "valtests" WHERE "valtests"."id" = ? LIMIT 1  [["id", 6]]

  def create
    @valtest = Valtest.new(valtest_params)
    if @valtest.save
---
INSERT INTO "valtests" ("email", "email_confirmation", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["email", "madh"], ["email_confirmation", ""], ["created_at", "2016-11-28 07:30:35.274414"], ["updated_at", "2016-11-28 07:30:35.274414"]]

  def update
    @valtest = Valtest.find(params[:id])
    if @valtest.update(valtest_params)
---
SELECT  "valtests".* FROM "valtests" WHERE "valtests"."id" = ? LIMIT 1  [["id", 6]]
UPDATE "valtests" SET "email" = ?, "email_confirmation" = ?, "password" = ?, "phone_number" = ?, "updated_at" = ? WHERE "valtests"."id" = ?  [["email", "tytytyty"], ["email_confirmation", "trytyyty"], ["password", "q343545"], ["phone_number", "1234567890"], ["updated_at", "2016-11-30 07:31:03.067317"], ["id", 20]]

  def destroy
    @valtest = Valtest.find(params[:id])
    @valtest.destroy
---
SELECT  "valtests".* FROM "valtests" WHERE "valtests"."id" = ? LIMIT 1  [["id", 6]]
DELETE FROM "valtests" WHERE "valtests"."id" = ?  [["id", 6]]