ROR/blog/app/controllers/articles_controller.rb

INSERT INTO "articles" ("text", "title", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["text", "ffdghfhtfgh"], ["title", "hjhghnhfggh"], ["created_at", "2016-11-22 07:24:09.642302"], ["updated_at", "2016-11-22 07:24:09.642302"]]
---
  def create
    @article = Article.new(article_params)

    if @article.save