ROR/demo1/app/controllers/employees_controller.rb

  def update
    @employee = Employee.find(params[:id])

    if @employee.update(params.require(:employee).permit(:name, :designation,:salary))
---
SELECT  "employees".* FROM "employees" WHERE "employees"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "employees" SET "name" = ?, "designation" = ?, "salary" = ?, "city" = ?, "updated_at" = ? WHERE "employees"."id" = ?  [["name", "madhu"], ["designation", "xyp"], ["salary", 300000.0], ["city", "t"], ["updated_at", "2016-11-25 12:35:20.880616"], ["id", 4]]

  def create
    @employee = Employee.new(params.require(:employee).permit(:name, :designation,:salary))
    @employee.save
---
INSERT INTO "employees" ("name", "designation", "salary", "city", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "madhu"], ["designation", "php devloper"], ["salary", 2000.0], ["city", "t"], ["created_at", "2016-11-25 08:56:41.559693"], ["updated_at", "2016-11-25 08:56:41.559693"]]

   def destroy
    @employee = Employee.find(params[:id])
    @employee.destroy
---
SELECT  "employees".* FROM "employees" WHERE "employees"."id" = ? LIMIT 1  [["id", 2]]
DELETE FROM "employees" WHERE "employees"."id" = ?  [["id", 2]]