ROR/library/app/controllers/books_controller.rb

INSERT INTO "authors" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", "2016-11-24 09:34:32.300031"], ["updated_at", "2016-11-24 09:34:32.300031"]]
---
  def create
    @book = Author.new(params.require(:book).permit(:name, :author))

    @book.save